{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_8", "layers": [{"name": "leftEye", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 26, 26, 3], "dtype": "float32", "sparse": false, "name": "leftEye"}, "inbound_nodes": []}, {"name": "facePic", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "facePic"}, "inbound_nodes": []}, {"name": "conv2d_50", "class_name": "Conv2D", "config": {"name": "conv2d_50", "trainable": true, "filters": 20, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leftEye", 0, 0, {}]]]}, {"name": "conv2d_54", "class_name": "Conv2D", "config": {"name": "conv2d_54", "trainable": true, "filters": 20, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["facePic", 0, 0, {}]]]}, {"name": "max_pooling2d_50", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_50", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_50", 0, 0, {}]]]}, {"name": "rightEye", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 26, 26, 3], "dtype": "float32", "sparse": false, "name": "rightEye"}, "inbound_nodes": []}, {"name": "max_pooling2d_54", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_54", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_54", 0, 0, {}]]]}, {"name": "facegrid", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15, 15, 3], "dtype": "float32", "sparse": false, "name": "facegrid"}, "inbound_nodes": []}, {"name": "conv2d_51", "class_name": "Conv2D", "config": {"name": "conv2d_51", "trainable": true, "filters": 20, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_50", 0, 0, {}]]]}, {"name": "conv2d_52", "class_name": "Conv2D", "config": {"name": "conv2d_52", "trainable": true, "filters": 20, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["rightEye", 0, 0, {}]]]}, {"name": "conv2d_55", "class_name": "Conv2D", "config": {"name": "conv2d_55", "trainable": true, "filters": 20, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_54", 0, 0, {}]]]}, {"name": "conv2d_56", "class_name": "Conv2D", "config": {"name": "conv2d_56", "trainable": true, "filters": 20, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["facegrid", 0, 0, {}]]]}, {"name": "max_pooling2d_51", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_51", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_51", 0, 0, {}]]]}, {"name": "max_pooling2d_53", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_53", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_52", 0, 0, {}]]]}, {"name": "max_pooling2d_55", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_55", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_55", 0, 0, {}]]]}, {"name": "max_pooling2d_56", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_56", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_56", 0, 0, {}]]]}, {"name": "flatten_29", "class_name": "Flatten", "config": {"name": "flatten_29", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_51", 0, 0, {}]]]}, {"name": "flatten_30", "class_name": "Flatten", "config": {"name": "flatten_30", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_53", 0, 0, {}]]]}, {"name": "flatten_31", "class_name": "Flatten", "config": {"name": "flatten_31", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_55", 0, 0, {}]]]}, {"name": "flatten_32", "class_name": "Flatten", "config": {"name": "flatten_32", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_56", 0, 0, {}]]]}, {"name": "dropout_29", "class_name": "Dropout", "config": {"name": "dropout_29", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_29", 0, 0, {}]]]}, {"name": "dropout_30", "class_name": "Dropout", "config": {"name": "dropout_30", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_30", 0, 0, {}]]]}, {"name": "dropout_31", "class_name": "Dropout", "config": {"name": "dropout_31", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_31", 0, 0, {}]]]}, {"name": "dropout_32", "class_name": "Dropout", "config": {"name": "dropout_32", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_32", 0, 0, {}]]]}, {"name": "concatenate_22", "class_name": "Concatenate", "config": {"name": "concatenate_22", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_29", 0, 0, {}], ["dropout_30", 0, 0, {}]]]}, {"name": "concatenate_23", "class_name": "Concatenate", "config": {"name": "concatenate_23", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_31", 0, 0, {}], ["dropout_32", 0, 0, {}]]]}, {"name": "dense_22", "class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_22", 0, 0, {}]]]}, {"name": "dense_23", "class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_23", 0, 0, {}]]]}, {"name": "concatenate_24", "class_name": "Concatenate", "config": {"name": "concatenate_24", "trainable": true, "axis": -1}, "inbound_nodes": [[["dense_22", 0, 0, {}], ["dense_23", 0, 0, {}]]]}, {"name": "dense_24", "class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_24", 0, 0, {}]]]}], "input_layers": [["leftEye", 0, 0], ["rightEye", 0, 0], ["facePic", 0, 0], ["facegrid", 0, 0]], "output_layers": [["dense_24", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "RMSprop", "config": {"lr": 0.0010000000474974513, "rho": 0.8999999761581421, "decay": 0.0, "epsilon": 1e-07}}, "loss": "mean_squared_error", "metrics": [], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["mbp_yf"], "weights": [{"name": "conv2d_50/kernel", "shape": [5, 5, 3, 20], "dtype": "float32"}, {"name": "conv2d_50/bias", "shape": [20], "dtype": "float32"}, {"name": "conv2d_51/kernel", "shape": [5, 5, 20, 20], "dtype": "float32"}, {"name": "conv2d_51/bias", "shape": [20], "dtype": "float32"}, {"name": "conv2d_52/kernel", "shape": [5, 5, 3, 20], "dtype": "float32"}, {"name": "conv2d_52/bias", "shape": [20], "dtype": "float32"}, {"name": "conv2d_54/kernel", "shape": [5, 5, 3, 20], "dtype": "float32"}, {"name": "conv2d_54/bias", "shape": [20], "dtype": "float32"}, {"name": "conv2d_55/kernel", "shape": [5, 5, 20, 20], "dtype": "float32"}, {"name": "conv2d_55/bias", "shape": [20], "dtype": "float32"}, {"name": "conv2d_56/kernel", "shape": [5, 5, 3, 20], "dtype": "float32"}, {"name": "conv2d_56/bias", "shape": [20], "dtype": "float32"}, {"name": "dense_22/kernel", "shape": [2600, 2], "dtype": "float32"}, {"name": "dense_22/bias", "shape": [2], "dtype": "float32"}, {"name": "dense_23/kernel", "shape": [1000, 2], "dtype": "float32"}, {"name": "dense_23/bias", "shape": [2], "dtype": "float32"}, {"name": "dense_24/kernel", "shape": [4, 2], "dtype": "float32"}, {"name": "dense_24/bias", "shape": [2], "dtype": "float32"}]}]}