{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_7", "layers": [{"name": "leftEye", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 26, 26, 3], "dtype": "float32", "sparse": false, "name": "leftEye"}, "inbound_nodes": []}, {"name": "facePic", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "facePic"}, "inbound_nodes": []}, {"name": "conv2d_43", "class_name": "Conv2D", "config": {"name": "conv2d_43", "trainable": true, "filters": 20, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leftEye", 0, 0, {}]]]}, {"name": "conv2d_47", "class_name": "Conv2D", "config": {"name": "conv2d_47", "trainable": true, "filters": 20, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["facePic", 0, 0, {}]]]}, {"name": "max_pooling2d_43", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_43", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_43", 0, 0, {}]]]}, {"name": "rightEye", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 26, 26, 3], "dtype": "float32", "sparse": false, "name": "rightEye"}, "inbound_nodes": []}, {"name": "max_pooling2d_47", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_47", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_47", 0, 0, {}]]]}, {"name": "facegrid", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15, 15, 3], "dtype": "float32", "sparse": false, "name": "facegrid"}, "inbound_nodes": []}, {"name": "conv2d_44", "class_name": "Conv2D", "config": {"name": "conv2d_44", "trainable": true, "filters": 20, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_43", 0, 0, {}]]]}, {"name": "conv2d_45", "class_name": "Conv2D", "config": {"name": "conv2d_45", "trainable": true, "filters": 20, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["rightEye", 0, 0, {}]]]}, {"name": "conv2d_48", "class_name": "Conv2D", "config": {"name": "conv2d_48", "trainable": true, "filters": 20, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_47", 0, 0, {}]]]}, {"name": "conv2d_49", "class_name": "Conv2D", "config": {"name": "conv2d_49", "trainable": true, "filters": 20, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["facegrid", 0, 0, {}]]]}, {"name": "max_pooling2d_44", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_44", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_44", 0, 0, {}]]]}, {"name": "max_pooling2d_46", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_46", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_45", 0, 0, {}]]]}, {"name": "max_pooling2d_48", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_48", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_48", 0, 0, {}]]]}, {"name": "max_pooling2d_49", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_49", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_49", 0, 0, {}]]]}, {"name": "flatten_25", "class_name": "Flatten", "config": {"name": "flatten_25", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_44", 0, 0, {}]]]}, {"name": "flatten_26", "class_name": "Flatten", "config": {"name": "flatten_26", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_46", 0, 0, {}]]]}, {"name": "flatten_27", "class_name": "Flatten", "config": {"name": "flatten_27", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_48", 0, 0, {}]]]}, {"name": "flatten_28", "class_name": "Flatten", "config": {"name": "flatten_28", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_49", 0, 0, {}]]]}, {"name": "dropout_25", "class_name": "Dropout", "config": {"name": "dropout_25", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_25", 0, 0, {}]]]}, {"name": "dropout_26", "class_name": "Dropout", "config": {"name": "dropout_26", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_26", 0, 0, {}]]]}, {"name": "dropout_27", "class_name": "Dropout", "config": {"name": "dropout_27", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_27", 0, 0, {}]]]}, {"name": "dropout_28", "class_name": "Dropout", "config": {"name": "dropout_28", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_28", 0, 0, {}]]]}, {"name": "concatenate_19", "class_name": "Concatenate", "config": {"name": "concatenate_19", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_25", 0, 0, {}], ["dropout_26", 0, 0, {}]]]}, {"name": "concatenate_20", "class_name": "Concatenate", "config": {"name": "concatenate_20", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_27", 0, 0, {}], ["dropout_28", 0, 0, {}]]]}, {"name": "dense_19", "class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_19", 0, 0, {}]]]}, {"name": "dense_20", "class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_20", 0, 0, {}]]]}, {"name": "concatenate_21", "class_name": "Concatenate", "config": {"name": "concatenate_21", "trainable": true, "axis": -1}, "inbound_nodes": [[["dense_19", 0, 0, {}], ["dense_20", 0, 0, {}]]]}, {"name": "dense_21", "class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_21", 0, 0, {}]]]}], "input_layers": [["leftEye", 0, 0], ["rightEye", 0, 0], ["facePic", 0, 0], ["facegrid", 0, 0]], "output_layers": [["dense_21", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "RMSprop", "config": {"lr": 0.0010000000474974513, "rho": 0.8999999761581421, "decay": 0.0, "epsilon": 1e-07}}, "loss": "mean_squared_error", "metrics": [], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["mbp_yf"], "weights": [{"name": "conv2d_43/kernel", "shape": [5, 5, 3, 20], "dtype": "float32"}, {"name": "conv2d_43/bias", "shape": [20], "dtype": "float32"}, {"name": "conv2d_44/kernel", "shape": [5, 5, 20, 20], "dtype": "float32"}, {"name": "conv2d_44/bias", "shape": [20], "dtype": "float32"}, {"name": "conv2d_45/kernel", "shape": [5, 5, 3, 20], "dtype": "float32"}, {"name": "conv2d_45/bias", "shape": [20], "dtype": "float32"}, {"name": "conv2d_47/kernel", "shape": [5, 5, 3, 20], "dtype": "float32"}, {"name": "conv2d_47/bias", "shape": [20], "dtype": "float32"}, {"name": "conv2d_48/kernel", "shape": [5, 5, 20, 20], "dtype": "float32"}, {"name": "conv2d_48/bias", "shape": [20], "dtype": "float32"}, {"name": "conv2d_49/kernel", "shape": [5, 5, 3, 20], "dtype": "float32"}, {"name": "conv2d_49/bias", "shape": [20], "dtype": "float32"}, {"name": "dense_19/kernel", "shape": [2600, 2], "dtype": "float32"}, {"name": "dense_19/bias", "shape": [2], "dtype": "float32"}, {"name": "dense_20/kernel", "shape": [1000, 2], "dtype": "float32"}, {"name": "dense_20/bias", "shape": [2], "dtype": "float32"}, {"name": "dense_21/kernel", "shape": [4, 2], "dtype": "float32"}, {"name": "dense_21/bias", "shape": [2], "dtype": "float32"}]}]}